InformationRegisters/ДанныеГабаритныйЧертеж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеГабаритныйЧертеж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьМодель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайняяДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановаяГотовностьГабаритныхЧертежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановаяГотовностьГабаритныхЧертежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗамера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбразец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образец</v8:Type>
								<v8:Type>cfg:CatalogRef.ПредварительныйОбразец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омГабаритныйЧертежНаСервере/Ext/Module.bsl
Функция ПолучитьНаименованиеГЧ(Проект, ОсновноеПомещение, НаименованиеБезКода, НомерВПомещении) Экспорт 
	
	
	КодСделки 		= "";
	КодПомещения 	= "";
	
	Если ЗначениеЗаполнено(Проект) Тогда
		КодСделки = Формат(Проект.Номер, "ЧЦ=2; ЧВН=");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновноеПомещение) Тогда
		КодПомещения = ОсновноеПомещение.НомерПомещения;
	КонецЕсли;

	Возврат Новый Структура("Наименование, ОсновноеПомещение", 
											КодСделки + "." + КодПомещения + ?(НомерВПомещении = 0, "", "-" + НомерВПомещении) + "." + НаименованиеБезКода,
											ОсновноеПомещение);
	
КонецФункции // СформироватьНаименованиеГЧ(ГабаритныйЧертежОбъект)

Функция ПолучитьГабаритныеЧертежиПоПомещениям(МассивПомещений, Проект = Неопределено) Экспорт

	Если Проект = Неопределено Тогда
		
		Если МассивПомещений.Количество() = 0 Тогда
			Возврат Новый Массив;
		КонецЕсли;
		
		СделкаПомещений = МассивПомещений[0].Проект;

	Иначе	
		СделкаПомещений = Проект;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежиПомещения.Ссылка КАК ГабаритныйЧертеж
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ГабаритныеЧертежи.Помещения КАК ГабаритныеЧертежиПомещения
		|ГДЕ
		|	ГабаритныеЧертежиПомещения.Ссылка.Проект = &Проект
		|	И НЕ ГабаритныеЧертежиПомещения.Помещение В (&МассивПомещений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГабаритныеЧертежиПомещения.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК ГабаритныйЧертеж
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО (вт.ГабаритныйЧертеж = ГабаритныеЧертежи.Ссылка)
		|ГДЕ
		|	вт.ГабаритныйЧертеж ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МассивПомещений", МассивПомещений);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГабаритныйЧертеж");
	
КонецФункции // ПолучитьГабаритныеЧертежиПоПомещениям()

Функция ПолучитьРодительГабаритногоЧертежа(Проект) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГабаритныеЧертежи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
		|ГДЕ
		|	ГабаритныеЧертежи.Проект = &Проект
		|	И ГабаритныеЧертежи.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
    Возврат Справочники.ГабаритныеЧертежи.ПустаяСсылка();
	
КонецФункции // ПолучитьРодительКопозиции()

Процедура УстановитьКодПДМДляГабаритныйЧертеж(ПараметрГабаритныйЧертеж, КодВПДМ) Экспорт

	
	Если ТипЗнч(ПараметрГабаритныйЧертеж) = Тип("Строка") Тогда
		ГабаритныйЧертеж = Справочники.ГабаритныеЧертежи.НайтиПоКоду(ПараметрГабаритныйЧертеж);
	Иначе
		ГабаритныйЧертеж = ПараметрГабаритныйЧертеж;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГабаритныйЧертеж) Тогда
	
		МенеджерЗаписей 					= РегистрыСведений.ДанныеГабаритныйЧертеж.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.ГабаритныйЧертеж 	= ГабаритныйЧертеж;
		
		МенеджерЗаписей.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписей.ГабаритныйЧертеж) Тогда
			
			Если НЕ МенеджерЗаписей.Код_в_PDM = КодВПДМ Тогда
				
				МенеджерЗаписей.Код_в_PDM = КодВПДМ;
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей.ГабаритныйЧертеж 	= ГабаритныйЧертеж;
			МенеджерЗаписей.Код_в_PDM 			= КодВПДМ;
			
			МенеджерЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // УстановитьКодПДМДляСделки()

Функция ПолучитьПлановуюДатуГотовностиГабаритногоЧертежа(ГабаритныйЧертеж) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановаяГотовностьГабаритныхЧертежей.ДатаГотовности КАК ДатаГотовности
		|ИЗ
		|	РегистрСведений.ПлановаяГотовностьГабаритныхЧертежей КАК ПлановаяГотовностьГабаритныхЧертежей
		|ГДЕ
		|	ПлановаяГотовностьГабаритныхЧертежей.ГабаритныйЧертеж = &ГабаритныйЧертеж";
	
	Запрос.УстановитьПараметр("ГабаритныйЧертеж", ГабаритныйЧертеж);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ДатаГотовности;	
	КонецЦикла;
	
	Возврат Дата(1, 1, 1);	

КонецФункции // ПолучитьПлановуюДатуГотовностиГабаритногоЧертежа(ГабаритныйЧертеж)

Функция ПолучитьГЧКомплекта(Комплект) Экспорт		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ИзделияКомплект.Родитель.ГабаритныйЧертеж КАК РодительГабаритныйЧертеж
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ГабаритныйЧертеж) Тогда
		
			Возврат Выборка.ГабаритныйЧертеж;	
		
		ИначеЕсли ЗначениеЗаполнено(Выборка.РодительГабаритныйЧертеж) Тогда
		
			Возврат Выборка.РодительГабаритныйЧертеж;	
		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Справочники.ГабаритныеЧертежи.ПустаяСсылка();
	
КонецФункции // ПолучитьГЧКомплекта()

Функция ПолучитьСтатусГЧ(ГЧ) Экспорт


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗамераСрезПоследних.СтатусЗамера КАК СтатусЗамера
		|ИЗ
		|	РегистрСведений.СостояниеЗамера.СрезПоследних(, ОбъектЗамера = &ГЧ) КАК СостояниеЗамераСрезПоследних";
	
	Запрос.УстановитьПараметр("ГЧ", ГЧ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтатусЗамера;
	КонецЦикла;
	
	Возврат Перечисления.СтатусыЗамера.ПустаяСсылка();
	
КонецФункции // ПолучитьСтатусГЧ()

Функция Получить_путь_PDM(ГабаритныйЧертеж) Экспорт

	

КонецФункции // Получить_путь_PDM()
